In [1]:
import numpy as np
import pandas as pd

# Seriler

In [5]:
# array yapısına benzerdir. index yerine sözlü gibidir.
# series

In [3]:
myDictionary = {"Betül": 22, "Fatma" : 20, "Mehmet" : 50}

In [4]:
pd.Series(myDictionary)

Betül     22
Fatma     20
Mehmet    50
dtype: int64

In [16]:
ages = [50,40,30]
names = ["Mehmet", "Altan" , "Zeynep", None , None]

In [17]:
pd.Series(ages)

0    50
1    40
2    30
dtype: int64

In [8]:
pd.Series(ages,names)

Mehmet    50
Altan     40
Zeynep    30
dtype: int64

In [9]:

pd.Series(data = ages, index=names)

Mehmet    50
Altan     40
Zeynep    30
dtype: int64

In [24]:
numpyArray = np.arange(5,10)

In [25]:
numpyArray

array([5, 6, 7, 8, 9])

In [27]:
pd.Series(numpyArray)

0    5
1    6
2    7
3    8
4    9
dtype: int64

In [37]:
contestResult = pd.Series(index= names , data= numpyArray)

In [38]:
contestResult["Zeynep"] #5 alan kişiyi çağırmış olduk.

7

In [40]:
contestResult + contestResult # yarışmaların toplamı

Mehmet    10
Altan     12
Zeynep    14
None      16
None      18
dtype: int64

Dataframe ; serilerin birleştirilmiş şekli.

In [143]:
random_array = np.random.randn(3,4) # randn fonksiyonu, standart normal dağılıma sahip (ortalama=0, varyans=1) rasgele sayılar üretir.
#3 satır 4 sütun

In [144]:
random_array

array([[-1.16348419,  0.41250106, -1.44345184, -1.23937643],
       [ 1.61365821,  1.79726584,  1.3952498 ,  0.18324858],
       [-0.77098727,  0.77495965,  0.42718491,  0.17967868]])

In [145]:
dataFrame = pd.DataFrame(random_array)

In [146]:
dataFrame

          0         1         2         3
0 -1.163484  0.412501 -1.443452 -1.239376
1  1.613658  1.797266  1.395250  0.183249
2 -0.770987  0.774960  0.427185  0.179679

In [147]:
dataFrame[0] # kolonu getirir.

0   -1.163484
1    1.613658
2   -0.770987
Name: 0, dtype: float64

In [148]:
newDataFrame = pd.DataFrame(random_array, index= ["Betül","Ali","Rıza"])

In [149]:
newDataFrame

              0         1         2         3
Betül -1.163484  0.412501 -1.443452 -1.239376
Ali    1.613658  1.797266  1.395250  0.183249
Rıza  -0.770987  0.774960  0.427185  0.179679

In [150]:
newDataFrame = pd.DataFrame(random_array, index= ["Betül","Ali","Rıza"], columns= ["Yaş", "Boy", "Kilo","Yıl"])

In [151]:
newDataFrame

            Yaş       Boy      Kilo       Yıl
Betül -1.163484  0.412501 -1.443452 -1.239376
Ali    1.613658  1.797266  1.395250  0.183249
Rıza  -0.770987  0.774960  0.427185  0.179679

In [152]:
newDataFrame["Yaş"]

Betül   -1.163484
Ali      1.613658
Rıza    -0.770987
Name: Yaş, dtype: float64

In [153]:
newDataFrame["Yaş"]["Betül"] # sadece betülün yaşını seçtik.

-1.1634841924041948

In [154]:
newDataFrame.loc["Betül"] # betülün tüm bilgilerini çektik.

Yaş    -1.163484
Boy     0.412501
Kilo   -1.443452
Yıl    -1.239376
Name: Betül, dtype: float64

In [155]:
newDataFrame.iloc[0] # 0. indekste olanlar gösterilir.

Yaş    -1.163484
Boy     0.412501
Kilo   -1.443452
Yıl    -1.239376
Name: Betül, dtype: float64

In [156]:
newDataFrame["Add 1 Column"] = np.zeros(3)
newDataFrame["Add 2 Column"]  = np.ones(3)

In [157]:
newDataFrame

            Yaş       Boy      Kilo       Yıl  Add 1 Column  Add 2 Column
Betül -1.163484  0.412501 -1.443452 -1.239376           0.0           1.0
Ali    1.613658  1.797266  1.395250  0.183249           0.0           1.0
Rıza  -0.770987  0.774960  0.427185  0.179679           0.0           1.0

In [158]:
newDataFrame = newDataFrame.drop("Add 1 Column", axis=1)
newDataFrame.drop("Add 2 Column", axis=1, inplace=True) # direk olarak siler.

In [159]:
newDataFrame.drop("Rıza")
#newDataFrame.drop("Rıza", axis=0)
#aynı sonucu verir.

            Yaş       Boy      Kilo       Yıl
Betül -1.163484  0.412501 -1.443452 -1.239376
Ali    1.613658  1.797266  1.395250  0.183249

In [160]:
booleanFrame = newDataFrame < 0

In [161]:
booleanFrame

         Yaş    Boy   Kilo    Yıl
Betül   True  False   True   True
Ali    False  False  False  False
Rıza    True  False  False  False

In [162]:
newDataFrame[booleanFrame] # sadece sıfırdan küçük olanların değerini gösterir diğerlerini none olarak gösterir.

            Yaş  Boy      Kilo       Yıl
Betül -1.163484  NaN -1.443452 -1.239376
Ali         NaN  NaN       NaN       NaN
Rıza  -0.770987  NaN       NaN       NaN

In [163]:
newDataFrame[newDataFrame["Yaş"] > 0] #yaş sıfırdan büyük olanları listeler.

          Yaş       Boy     Kilo       Yıl
Ali  1.613658  1.797266  1.39525  0.183249

In [165]:
newDataFrame.reset_index(inplace=False)

   index       Yaş       Boy      Kilo       Yıl
0  Betül -1.163484  0.412501 -1.443452 -1.239376
1    Ali  1.613658  1.797266  1.395250  0.183249
2   Rıza -0.770987  0.774960  0.427185  0.179679

In [167]:
newDataFrame["Yeni Indeks"] = ["bt", "ai", "rz"]

In [168]:
newDataFrame

            Yaş       Boy      Kilo       Yıl Yeni Indeks
Betül -1.163484  0.412501 -1.443452 -1.239376          bt
Ali    1.613658  1.797266  1.395250  0.183249          ai
Rıza  -0.770987  0.774960  0.427185  0.179679          rz

In [171]:
newDataFrame.set_index("Yeni Indeks", inplace=True) # ilk kolon gider ve "Yeni Indeks" olur.

In [174]:
newDataFrame.loc["bt"]

Yaş    -1.163484
Boy     0.412501
Kilo   -1.443452
Yıl    -1.239376
Name: bt, dtype: float64

In [175]:
firstIndexes = ["Simpson","Simpson","Simpson", "South Park", "South Park", "South Park"]

In [176]:
inIndexes = ["Homer", "Bart", "Margarita", "Cartman","Kenny","Cayla"]

In [181]:
mergingIndex = list(zip(firstIndexes, inIndexes))

In [182]:
mergingIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Margarita'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Cayla')]

In [183]:
mergingIndex = pd.MultiIndex.from_tuples(mergingIndex)

In [185]:
mergingIndex

MultiIndex([(   'Simpson',     'Homer'),
            (   'Simpson',      'Bart'),
            (   'Simpson', 'Margarita'),
            ('South Park',   'Cartman'),
            ('South Park',     'Kenny'),
            ('South Park',     'Cayla')],
           )

In [197]:
animationList = [[40, "A"], [50, "B"],[60, "C"],[70, "D"],[80, "E"],[90, "F"]]

In [198]:
animationList = pd.DataFrame(animationList, index=mergingIndex, columns= ["Yaş","Meslek"])

In [199]:
animationList

                      Yaş Meslek
Simpson    Homer       40      A
           Bart        50      B
           Margarita   60      C
South Park Cartman     70      D
           Kenny       80      E
           Cayla       90      F

In [200]:
animationList.loc["Simpson"]

           Yaş Meslek
Homer       40      A
Bart        50      B
Margarita   60      C

In [201]:
animationList.loc["Simpson"].loc["Bart"]

Yaş       50
Meslek     B
Name: Bart, dtype: object

In [205]:
animationList.index.names = ["Film Adı" ,"İsim"]

In [206]:
animationList

                      Yaş Meslek
Film Adı   İsim
Simpson    Homer       40      A
           Bart        50      B
           Margarita   60      C
South Park Cartman     70      D
           Kenny       80      E
           Cayla       90      F

In [207]:
dictData = {"Istanbul": [30, 29, None], "Ankara" : [20, None, 50], "Izmir" : [32, 22, None]}

In [209]:
weatherForecastDataFrame = pd.DataFrame(dictData)

In [210]:
weatherForecastDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0   32.0
1      29.0     NaN   22.0
2       NaN    50.0    NaN

In [212]:
weatherForecastDataFrame.dropna() #tüm none sütun ve satırları siler.

   Istanbul  Ankara  Izmir
0      30.0    20.0   32.0

In [214]:
weatherForecastDataFrame.dropna(axis= 0)

   Istanbul  Ankara  Izmir
0      30.0    20.0   32.0

In [215]:
dictData = {"Istanbul": [30, 29, None], "Ankara" : [20, None, 50], "Izmir" : [32, 22, None], "Antalya" : [None , None, 10]}

In [216]:
weatherForecastDataFrame = pd.DataFrame(dictData)

In [218]:
weatherForecastDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0   32.0      NaN
1      29.0     NaN   22.0      NaN
2       NaN    50.0    NaN     10.0

In [220]:
weatherForecastDataFrame.dropna(axis= 1, thresh=2) # 2'den fazla none olan sütunları göstermez.

   Istanbul  Ankara  Izmir
0      30.0    20.0   32.0
1      29.0     NaN   22.0
2       NaN    50.0    NaN

In [221]:
weatherForecastDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0   32.0      NaN
1      29.0     NaN   22.0      NaN
2       NaN    50.0    NaN     10.0

In [222]:
weatherForecastDataFrame.fillna(20) #none olan satırları 20 ile doldurur.

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0   32.0     20.0
1      29.0    20.0   22.0     20.0
2      20.0    50.0   20.0     10.0

# Groupby

In [229]:
salaryDict = {"Department" : ["Yazılım","Satış","Pazarlama","Finans","İnsan Kaynakları","Hukuk"],
              "Çalışan İsmi" : ["Ahmet", "Mehmet","Burak", "Zeynep","Fatma","Betül"],
               "Maaş": [2000,5000,6000,15000,40000,500000]}

In [230]:
salaryDataFrame = pd.DataFrame(salaryDict)

In [231]:
salaryDataFrame

         Department Çalışan İsmi    Maaş
0           Yazılım        Ahmet    2000
1             Satış       Mehmet    5000
2         Pazarlama        Burak    6000
3            Finans       Zeynep   15000
4  İnsan Kaynakları        Fatma   40000
5             Hukuk        Betül  500000

In [232]:
salaryDict = {"Department" : ["Yazılım","Yazılım","Pazarlama","Hukuk","İnsan Kaynakları","Hukuk"],
              "Çalışan İsmi" : ["Ahmet", "Mehmet","Burak", "Zeynep","Fatma","Betül"],
               "Maaş": [2000,5000,6000,15000,40000,500000]}

In [233]:
salaryDataFrame = pd.DataFrame(salaryDict)

In [234]:
salaryDataFrame

         Department Çalışan İsmi    Maaş
0           Yazılım        Ahmet    2000
1           Yazılım       Mehmet    5000
2         Pazarlama        Burak    6000
3             Hukuk       Zeynep   15000
4  İnsan Kaynakları        Fatma   40000
5             Hukuk        Betül  500000

In [243]:
groupObject = salaryDataFrame.groupby("Department")

In [244]:
groupObject.count()

                  Çalışan İsmi  Maaş
Department
Hukuk                        2     2
Pazarlama                    1     1
Yazılım                      2     2
İnsan Kaynakları             1     1

In [247]:
groupObject.max()

                 Çalışan İsmi    Maaş
Department
Hukuk                  Zeynep  500000
Pazarlama               Burak    6000
Yazılım                Mehmet    5000
İnsan Kaynakları        Fatma   40000

In [249]:
groupObject.describe() #tüm her şeyi açıklanır.

                  Maaş                                                        \
                 count      mean            std      min       25%       50%
Department
Hukuk              2.0  257500.0  342946.788875  15000.0  136250.0  257500.0
Pazarlama          1.0    6000.0            NaN   6000.0    6000.0    6000.0
Yazılım            2.0    3500.0    2121.320344   2000.0    2750.0    3500.0
İnsan Kaynakları   1.0   40000.0            NaN  40000.0   40000.0   40000.0


                       75%       max
Department
Hukuk             378750.0  500000.0
Pazarlama           6000.0    6000.0
Yazılım             4250.0    5000.0
İnsan Kaynakları   40000.0   40000.0

# Concatenation

In [252]:
dict1 = {"Isim" : ["Ahmet" , "Mehmet" , "Ali", "Atıl"],
        "Spor": ["Koşu", "Yüzme", "Basketbol", "Koşu"],
        "Kalori": [100,200,300,400]}

In [262]:
dataFrame1 = pd.DataFrame(dict1 , index=[4,5,6,7])

In [263]:
dataFrame1

     Isim       Spor  Kalori
4   Ahmet       Koşu     100
5  Mehmet      Yüzme     200
6     Ali  Basketbol     300
7    Atıl       Koşu     400

In [264]:
dict2 = {"Isim" : ["Ahmet2" , "Mehmet2" , "Ali2", "Atıl2"],
        "Spor": ["Koşu", "Yüzme", "Basketbol", "Koşu"],
        "Kalori": [100,200,300,400]}
dict3 = {"Isim" : ["Ahmet3" , "Mehmet3" , "Ali3", "Atıl3"],
        "Spor": ["Koşu", "Yüzme", "Basketbol", "Koşu"],
        "Kalori": [100,200,300,400]}

In [265]:
dataFrame2 = pd.DataFrame(dict2, index=[8,9,10,11])
dataFrame3 = pd.DataFrame(dict3, index=[12,13,14,15])

In [266]:
dataFrame2

       Isim       Spor  Kalori
8    Ahmet2       Koşu     100
9   Mehmet2      Yüzme     200
10     Ali2  Basketbol     300
11    Atıl2       Koşu     400

In [267]:
dataFrame3

       Isim       Spor  Kalori
12   Ahmet3       Koşu     100
13  Mehmet3      Yüzme     200
14     Ali3  Basketbol     300
15    Atıl3       Koşu     400

In [270]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

       Isim       Spor  Kalori
4     Ahmet       Koşu     100
5    Mehmet      Yüzme     200
6       Ali  Basketbol     300
7      Atıl       Koşu     400
8    Ahmet2       Koşu     100
9   Mehmet2      Yüzme     200
10     Ali2  Basketbol     300
11    Atıl2       Koşu     400
12   Ahmet3       Koşu     100
13  Mehmet3      Yüzme     200
14     Ali3  Basketbol     300
15    Atıl3       Koşu     400

# Merge

In [275]:
newFrame = pd.merge(dataFrame1,dataFrame2, on="Spor") #spor kolonuna göre birleştirme yapar, yani ortak kolonlar üzerinden işlemler yapılır.

In [276]:
newFrame["Spor"]

0         Koşu
1         Koşu
2         Koşu
3         Koşu
4        Yüzme
5    Basketbol
Name: Spor, dtype: object

In [277]:
newFrame["Spor"].unique() # benzersiz değerleri gösterir.

array(['Koşu', 'Yüzme', 'Basketbol'], dtype=object)

In [279]:
newFrame["Spor"].nunique()

3

In [281]:
newFrame["Spor"].value_counts() #hangi satırdan toplam ne kadar değer olduğunu gösterir.

Spor
Koşu         4
Yüzme        1
Basketbol    1
Name: count, dtype: int64

In [282]:
def kaloriCarp(kalori):
    return kalori*10

In [284]:
newFrame["Kalori_x"].apply(kaloriCarp) #.apply ile istediğimiz fonksiyonları frame içindeki değerleri kullanabiliriz.

0    1000
1    1000
2    4000
3    4000
4    2000
5    3000
Name: Kalori_x, dtype: int64

In [286]:
newFrame.isnull() #null olan değerler true olarak döner.

   Isim_x   Spor  Kalori_x  Isim_y  Kalori_y
0   False  False     False   False     False
1   False  False     False   False     False
2   False  False     False   False     False
3   False  False     False   False     False
4   False  False     False   False     False
5   False  False     False   False     False

## Pivottable

In [304]:
newData = {"Karakter Sınıfı": ["South Park", "South Park", "Simpson", "Simpson", "Simpson", "Simpson"],
           "Karakter İsmi" : ["Jack", "Soue", "Ryan", "Bernadette", "Bart", "Bart"],
            "Karakter Yaşı" : [10,120,20,30,5,10]}

In [305]:
newFrame = pd.DataFrame(newData)

In [306]:
newFrame

  Karakter Sınıfı Karakter İsmi  Karakter Yaşı
0      South Park          Jack             10
1      South Park          Soue            120
2         Simpson          Ryan             20
3         Simpson    Bernadette             30
4         Simpson          Bart              5
5         Simpson          Bart             10

In [308]:
newFrame.pivot_table(values="Karakter Yaşı" , index= ["Karakter Sınıfı" , "Karakter İsmi"])
# bartın iki yaş değeri var, pivottable bu değerleri toplayıp ortalamasını alır.

                               Karakter Yaşı
Karakter Sınıfı Karakter İsmi
Simpson         Bart                     7.5
                Bernadette              30.0
                Ryan                    20.0
South Park      Jack                    10.0
                Soue                   120.0

In [311]:
newFrame = newFrame.pivot_table(values="Karakter Yaşı" , index= ["Karakter Sınıfı" , "Karakter İsmi"], aggfunc=np.sum)
# bartın iki yaş değeri var, pivottable bu değerleri "aggfunc=np.sum" kullanarak toplayıp  alır.

/tmp/ipykernel_6576/2231456719.py:1: FutureWarning: The provided callable <function sum at 0x7fd278268a60> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  newFrame = newFrame.pivot_table(values="Karakter Yaşı" , index= ["Karakter Sınıfı" , "Karakter İsmi"], aggfunc=np.sum)

In [313]:
newFrame.to_excel("pvt_tbl.xlsx") # verileri excele yazdırmak istersek.

In [316]:
data = pd.read_excel("pvt_tbl.xlsx") #bu verileri okumak için

In [317]:
data

  Karakter Sınıfı Karakter İsmi  Karakter Yaşı
0         Simpson          Bart             15
1             NaN    Bernadette             30
2             NaN          Ryan             20
3      South Park          Jack             10
4             NaN          Soue            120